app/controllers/games_controller.rb

    def create
      @game = Game.new(game_params)

      if @game.save
---
INSERT INTO "games" ("name", "date", "manager_id", "complete_status", "fixture_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def destroy
      @game = Game.find(params[:id])

      @game.destroy!
---
SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
DELETE FROM "games" WHERE "games"."id" = $1  [["id", 1]]