app/controllers/sessions_controller.rb

    def create
        # Find the user by email
        @user = Manager.find_by(email: params[:manager][:email])

        # If no user is found, return a custom message for invalid email
        if @user.nil?
          return render json: { error: 'Invalid email address' }, status: :unprocessable_entity
        end

        # Authenticate the user with the provided password
        if @user.authenticate(params[:manager][:password])
          # JWT token creation with expiration time of 1 hour
          token = JWT.encode({
            user_id: @user.id,  # Use @user here
            email: @user.email,  # Use @user here
            exp: 1.hour.from_now.to_i
          }, SESSION_KEY, 'HS256')

          Rails.logger.debug "Generated Token: #{token}"

          # Set the JWT token in cookies (secure, httpOnly, SameSite Lax for security)
          cookie = cookies.signed[:token] = {
            value: token,
            httponly: true,
            same_site: :lax,
            expires: 1.hour.from_now,
            secure: Rails.env.production? ? true : false
          }

          @user.update(online: true)
---
SELECT "managers".* FROM "managers" WHERE "managers"."email" = $1 LIMIT $2  [["email", "[FILTERED]"], ["LIMIT", 1]]
UPDATE "managers" SET "online" = $1, "updated_at" = $2 WHERE "managers"."id" = $3  [["online", true], ["updated_at", "2025-02-18 20:45:34.971068"], ["id", 5]]